group-reports/sharif/results/10G-disk-throughput-tuning-protocol-A/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=17706: Fri Jul 14 15:10:18 2023
   read: IOPS=192, BW=771MiB/s (808MB/s)(452GiB/600080msec)
    slat (usec): min=33, max=915880, avg=3513.00, stdev=4134.89
    clat (msec): min=27, max=1031, avg=79.52, stdev=18.64
     lat (msec): min=28, max=1038, avg=83.03, stdev=18.85
    clat percentiles (msec):
     |  1.00th=[   71],  5.00th=[   73], 10.00th=[   77], 20.00th=[   77],
     | 30.00th=[   78], 40.00th=[   78], 50.00th=[   79], 60.00th=[   80],
     | 70.00th=[   82], 80.00th=[   82], 90.00th=[   84], 95.00th=[   86],
     | 99.00th=[   93], 99.50th=[  117], 99.90th=[  372], 99.95th=[  401],
     | 99.99th=[  986]
   bw (  KiB/s): min=40960, max=876544, per=99.99%, avg=789108.83, stdev=62402.37, samples=1200
   iops        : min=   10, max=  214, avg=192.61, stdev=15.23, samples=1200
  lat (msec)   : 50=0.49%, 100=98.64%, 250=0.71%, 500=0.13%, 750=0.01%
  lat (msec)   : 1000=0.01%
  cpu          : usr=0.15%, sys=1.88%, ctx=130311, majf=0, minf=554
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=115624,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=771MiB/s (808MB/s), 771MiB/s-771MiB/s (808MB/s-808MB/s), io=452GiB (485GB), run=600080-600080msec

Disk stats (read/write):
    drbd1: ios=925037/12, merge=0/0, ticks=58094285/97, in_queue=58094382, util=100.00%, aggrios=925037/13, aggrmerge=0/0, aggrticks=58098409/77, aggrin_queue=58098486, aggrutil=100.00%
    dm-0: ios=925037/13, merge=0/0, ticks=58098409/77, in_queue=58098486, util=100.00%, aggrios=924992/10, aggrmerge=45/3, aggrticks=57697923/72, aggrin_queue=57238408, aggrutil=100.00%
  sde: ios=924992/10, merge=45/3, ticks=57697923/72, in_queue=57238408, util=100.00%