group-reports/sharif/results/10G-disk-throughput-tuning-protocol-A/test-4.txt
write-randomly-test-job: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
write-randomly-test-job: Laying out IO file (1 file / 10240MiB)

write-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=21912: Fri Jul 14 15:40:53 2023
  write: IOPS=7098, BW=55.5MiB/s (58.2MB/s)(32.5GiB/600021msec)
    slat (usec): min=2, max=436240, avg=2214.36, stdev=5246.69
    clat (usec): min=722, max=709608, avg=33843.34, stdev=18313.71
     lat (usec): min=829, max=709740, avg=36057.99, stdev=19026.76
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[   11], 10.00th=[   15], 20.00th=[   20],
     | 30.00th=[   24], 40.00th=[   28], 50.00th=[   32], 60.00th=[   36],
     | 70.00th=[   41], 80.00th=[   47], 90.00th=[   56], 95.00th=[   65],
     | 99.00th=[   83], 99.50th=[   91], 99.90th=[  127], 99.95th=[  236],
     | 99.99th=[  397]
   bw (  KiB/s): min=  400, max= 6192, per=6.25%, avg=3548.87, stdev=688.07, samples=19200
   iops        : min=   50, max=  774, avg=443.59, stdev=86.00, samples=19200
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.39%, 4=0.83%, 10=3.16%, 20=16.54%, 50=63.17%
  lat (msec)   : 100=15.66%, 250=0.20%, 500=0.04%, 750=0.01%
  cpu          : usr=0.23%, sys=17.93%, ctx=40457889, majf=0, minf=146
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4259535,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=55.5MiB/s (58.2MB/s), 55.5MiB/s-55.5MiB/s (58.2MB/s-58.2MB/s), io=32.5GiB (34.9GB), run=600021-600021msec

Disk stats (read/write):
    drbd1: ios=0/4271734, merge=0/0, ticks=0/55907874, in_queue=55907874, util=98.40%, aggrios=0/4272978, aggrmerge=0/0, aggrticks=0/32777873, aggrin_queue=32777873, aggrutil=95.02%
    dm-0: ios=0/4272978, merge=0/0, ticks=0/32777873, in_queue=32777873, util=95.02%, aggrios=0/4266788, aggrmerge=0/6190, aggrticks=0/31872476, aggrin_queue=29739408, aggrutil=94.83%
  sde: ios=0/4266788, merge=0/6190, ticks=0/31872476, in_queue=29739408, util=94.83%